/*
'=' : 오른쪽의 값을 왼쪽에 대입하는 연산자
'==' : 컴퓨터에서 같다는 뜻
&&변수 : 변하는 값을 저장하는 저장소
 1) 변수선언(식별자) :메모리 공간에 데이터값(정수형, 실수형, 문자형)을 읽고 쓰고 그릇
 2) 변수선언규칙 : 대소문자 구별, 알파벳, 숫자, 언더바(_)를 사용,첫글자는 숫자,공백,기호로 시작은 안됨,언더바를 제외한 기호사용 불가
 3) 선언방법 1
    int a,b,c;
    선언방법 2
	int a;
	int b;
	int c;
 4) 변수 초기화 : 변수선언동시에 값을 지정한다.
    방법 1
	int a=10, b=20, c=30;
	방법 2
	int a=10;
	int b=20;
	int c=30;
 5) 진법으로 값을 초기화하는 법
    int a=10; => 10진수
	int b=013; => 8진수
	int c=0x13; => 16진수
	char d = 'A'; => 아스키코드의 값이 출력된다. 65가 됨






*/



#include <stido.h>
void main()
{
	
	return 0;
}
