/* 
 비트 : 0 또는 1
 니블 : 4비트
 바이트 : 8비트가 모여서 1바이트
 워드 : 2바이트 -> 하나의 기계어 명령이나 연산을 통해 저장된 장치로부터 레지스터에 옮겨 놓을 수 있는 데이터 단위.
 필드 : 파일구성의 최소 단위
 레코드(멤버) : 하나 이상의 필드가 모여 구성된다. 기본적인 자료구조 
 파일 : 하나 이상의 레코드가 모여 구성된다.
 2진수 : 0과 1로 이루어진 단위
 8진수(2의3승 - 3개씩 끊어서 변환)
 16진수(2의4승 - 4개씩 끊어서 변환)
 
 데이터 타입
 1. 정수형 : 소수점이 없는 데이터를 입력하기 위해 사용하는 데이터 형식
  1) unsinged char(부호가 없는 한 문자) : 1바이트(8비트 256개) => 범위 0~255
  2) char(부호가 있는 한 문자)
         (아스키코드값으로 되어 있는 대응 문자) : 영문자, 기호 숫자등 0~127의 값) 
		 : 1바이트(8비트 256개) => 범위 -128 ~ 127
  3) short(작은 정수형) : 2바이트(16비트 2^16개) => -32,768 ~ 32,767
  4) int(정수형) : 4바이트(32비트 2^32비트) => -2^31 ~ 2^31-1 (2^31 -> 약 21억) 
  5) long int 또는 long(큰정수) : == int
 2. 실수형 : 소수점이 있는 데이터(유효숫자, 소수점위치를 나누어서 저장한다)
  -실수는 메모리 공간을 절약하면서 큰 수를 표기하기 위해 부호, 지수, 가수를 분리해서 표현하는 부동소수점 방식을 사용한다.
  42949000000000라는 숫자는 4.2949*10^14 또는 4.2949e+14라고 표현할 수 있다. 이 때 42949를 가수, 14를 가수라고 한다.
  지수(소수점 위치),가수(유효숫자) - 나누어 저장하는 개념은 알아야한다.
  1) float (정밀도는 소수점 아래 7자리까지 표현) : 4바이트 => +-3.4*10^-37, +-3.4*10^38
  2) double(정밀도는 소수점 아래 16자리 표현) : 8바이트 => +-1.7*10&-307, +-1.7*10^307
 */
#include <stdio.h>
void main()
{
	int a=100;
	int b=200;
	float c = 0.123456789;
	double d = 0.1234567890123456789012345;
	char e = 65;
	printf("%d\n", a + b);
	printf("%d\n", a - b);
	printf("%d\n", a * b);
	printf("%d\n", a / b);
	printf("%30.9f\n",c);
	printf("%30.16lf\n",d);
	printf("%c\n", e);
}