// 한줄 주석
/* 두줄이상, 문단주석
변수(식별자)? ----함수명, 클래스명, 메소드명
-데이터 타입에 맞게 그릇을 지정
-대소문자 구별, 알파벳, 숫자, 언더바( _ ) 조합하여 지정
-첫글자는 공백과 숫자가 오면 안 된다.
-언더바를 제외한 기호는 사용 불가

데이터타입
 - 정수형 : unsigned int, short(2byte), int(4), long(8), char(1)
 - 실수형 : float(4byte), double(8byte)
 - 문자형 : char는 아스키코드값으로 표현(0~127), 0=>48, A=>65, a=>97
*/

/*
printf() 함수
-표준입출력 중에 출력으로 모니터에 무언가를 보여주는 역할
-모니터에 큰 따음표(" ")안에 내용을 그대로 출력하라는 의미
-숫자를 출력하면 가중치를 가지는 실제 값

서식문자(format
- %d : 부호 있는 10진수 정수
- %u : 부호 없는 10진수 정수
- %x : 부호 없는 16진수 정수, 소문자 사용(a,b,c,d,e,f)
- %X : 부호 없는 16진수 정수, 대문자 사용(A,B,C,D,E,F)
- %f : 부호 있는 10진수 실수
- %e : 부동소수점 표현 방식의 10진 실수(가수e+지수 형태로 출력)
- %E : 부동소수점 표현 방식의 10진 실수(가수E+지수 형태로 출력)
- %c : 문자
- %s : 문자열
- %p : 포인터(메모리 주소)
- %% : %기호 자체 출력
*/
#include <stdio.h>
int main(void)
{
	int radius = 10;
	double pi = 3.141592;
	printf("radius = %d, PI = %f\n", radius, pi);
	printf("radius = %05d\n", radius); //05는 정수형 5자리이고 남는 자리수는 0으로 채워라
	printf("PI = %0.2f\n", pi); //소수점의 자리수는 2자리로 표현
	return 0;
}